# Завдання: написати програму обчислення факторіалу числа.
#           Программа запитує ввод від користувача у циклі
#           (вихід можливий за допомогою Ctrl-C/D)
# 
# Факторіал числа: n!
# n! = 1 * 2 * 3 * 4 ... n-1 * n
# 0! = 1
#
# Приклад роботи:
#
# Введіть число для обчислення факторіалу: 5
# 5! == 120
# 
# Введіть число для обчислення факторіалу: -5
# Невірний ввод

while True:
	n = (int(input(f"Введіть число для обчислення факторіалу: ")))
	if n >= 0:
		def factorial(n):
			result = 1
			for i in range(1, n + 1):
				result *= i
			return result


		result = factorial(n)
		print(n, '! = ', result, sep="")
	else:
		print("Невірний ввод")


