# Завдання: порахуйте кількість літер строки. Строка та літера
#           даються на вхід користувачем. В залежності від кількости
#           виведіть на екран поясненя: строка містить літеру "с" до 
#           10 разів, строка містить літеру "с" до 20 разid, строка містить
#           символ "c" більше 20 разів. Проінформуйте користувача якщо
#           введено більше ніж одну літеру (літера має довжину більше 1)
#           або повідомляти якщо такої літери взагалі не знайдено.
#
# Підказка:
# * input() - ввод від користувача
# * len(str) - довжина строки
# * str.count(letter) - підрахунок елементів (літер) letter
# * if - elif - else - для логіки виводу на екран
#
# Приклад:
#
# Введіть текст: Це якийсь рандомний текст
# Введіть літеру: й
# Строка містить літеру "й" до 10 разів.
#
# Введіть текст: аааааааааааааааааааааааа
# Введіть літеру: а
# Строка містить літеру "а" більше 20 разів.


text = str(input("Введіть текст: "))  # зчитування значення від користувача
lit = str(input("Введіть літеру: "))
lit_count = int(text.count(lit))

if len(lit) > 1:
    print("Ви ввели більше ніж 1 літеру")
elif lit_count < 1:
    print(f"Літери {lit} не знайдено")
elif lit_count <= 20:
    print(f"Строка містить літеру {lit} до {lit_count} разів")
else:
    print(f"Строка містить літеру {lit} більше 20 разів")
